content-api-crud/update-and-search.yml
execution:
- scenario: update
  concurrency: 1
  iterations: 1
  hold-for: 0s
  ramp-up: 0s
- scenario: create-search
  concurrency: 1
  iterations: 1
  hold-for: 0s
  ramp-up: 0s

scenarios:
  update:
    think-time: 0ms # delay between each request
    variables:
      create-path: /create/path
    default-address: https://${__P(hostname)}
    data-sources:
      - path: ./data/id.csv
        variable-name: id
        loop: false
    requests:
      - url: ${create-path}/${id}
        method: GET
        label: 01 Read
        assert:
          - contains: 200
            subject: http-code
        extract-jsonpath:
          response: $
        jsr223:
          language: javascript
          script-file: ./scripts/writeResponseToFile.js
          execute: after
      - url: ${create-path}
        method: POST
        label: 02 Update
        upload-files:
          - param: document
            path: ./out/update-item.json
  create-search:
    think-time: 1000ms # delay between each request
    timeout: 30000ms
    keepalive: false # reuse same connection if true
    variables:
      create-path: /create/path
      search-path: /search/path
      index: searchindex
      totalCount: 0
    default-address: https://${__P(hostname)}
    requests:
    - url: ${create-path}
      method: POST
      label: 03 Create
      upload-files:
        - param: attachment
          path: ./payload/sample-file.pdf
        - param: document
          path: ./payload/create-body.json
      extract-jsonpath:
        id: $.id
    - while: ${__javaScript("${totalCount}" == 0,)}
      do:
      - url: ${search-path}/${index}
        method: POST
        label: 04 Search
        headers:
          Content-Type: application/json
        body: '{"filters":[{"field":"id","term":"${id}"}]}'
        extract-jsonpath:
          totalCount:
            jsonpath: $.totalCount
    - set-variables:
        totalCount: 0

reporting:
- module: final-stats
- module: console

settings:
  artifacts-dir: ./results/update-search-5000/%Y-%m-%d_%H-%M-%S

services:
- module: shellexec
  prepare:
    - mkdir -p ./out
  post-process:
    - rm -r ./out